package com.edu.notice_board.dao;

import java.util.List;

import com.edu.notice_board.domain.NoticeVO;


public interface M_NoticeDAO {

	public List<NoticeVO> m_noticelist() throws  Exception;
	
	//	-----------------------------------------------------------------------------------------------------------
	//	 게시글 작성
	//	-----------------------------------------------------------------------------------------------------------
	public void noticewrite(NoticeVO noticeVO) throws Exception;
	
	//-----------------------------------------------------------------------------------------------------------
	// 글번호에 해당하는 게시글의 상세정보를 가져온다.
	//-----------------------------------------------------------------------------------------------------------
	public NoticeVO noticeview(int bno) throws Exception;
	
	//-------------------------------------------------------------------------------------------------
	// 글번호에 해당하는 게시글의 내용을 수정한다.
	//-------------------------------------------------------------------------------------------------
	public void noticeupdate(NoticeVO noticeVO) throws Exception;
	
	//-------------------------------------------------------------------------------------------------
	// 게시글 번호에 해당하는 게시글의 정보를 삭제한다. : POST
	//-------------------------------------------------------------------------------------------------
	public void noticedelete(int bno) throws Exception;

}
